rubenmuehlhans/floor-heating-ctrl/apps/manifold/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# Flash und Partitionen: zwei OTA-Slots auf 4 MB
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Groesse vor Geschwindigkeit - das Flash-Budget ist knapp
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# WLAN
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16

# Bluetooth: ausschliesslich Observer (passives Mithoeren der Thermometer)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=n
# Ein Mithoerer baut keine Verbindungen auf und braucht weder Pairing noch
# aufgeloeste Zufallsadressen.
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_HS_PVCY=n
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n

# WLAN und BLE teilen sich die Funkstufe
CONFIG_ESP_COEX_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Drei Zeitserver
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# HTTP-Server fuer die Oberflaeche
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y

# Aufraeumen beim Neustart nach OTA
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Kurzlebige HTTP-Verbindungen: Jede geschlossene Verbindung belegt danach noch
# TCP_MSL lang einen Verwaltungsblock. Bei 16 Bloecken und einer Minute Haltezeit
# sind sie unter Last aufgebraucht, und neue Verbindungen werden zwar auf
# TCP-Ebene angenommen, aber nie bedient -- der Aufrufer wartet ins Leere.
# Mehr Bloecke und eine kurze Haltezeit; ein Heimnetz braucht die volle
# Wartezeit nicht, sie schuetzt vor verspaeteten Paketen aus dem Internet.
CONFIG_LWIP_MAX_ACTIVE_TCP=32
CONFIG_LWIP_TCP_MSL=5000
